# Pandas 라이브러리

---

## 학습 목표
- 데이터를 정제하고 편집하기 위해 Pandas 라이브러리의 쥬요 함수 사용법을 학습

<br>

---

## 목차
1. [Series](#1.Series)
2. [DataFrame](#2.DataFrame)    
2. [pivot_table](#2.pivot_table)

# Pandas 라이브러리
**pandas**는 row와 column으로 이뤄진 데이터 객체를 생성하고 수정하기 위한 패키지입니다.

numpy는 수학적 계산을 위한 배열에 초점이 맞춰졌다면, pandas는 데이터 분석에 초점이 맞추어져 빅데이터를 다루는데 편리합니다.

머신러닝에서 사용하는 데이터는 여러 column으로 이루어져 있고, pandas에서 제공하는 유용한 함수를 사용하여 데이터들의 분석과 처리를 할 수 있습니다.

라이브러리 import 하기

In [1]:
import pandas as pd
import numpy as np

### 1.Series

Pandas에는 두 종류의 자료구조가 있습니다.    
**Series**는 1차월 배열과 같은 자료구조로 1차원 배열의 값과 인덱스 값을 같이 저장합니다.

In [2]:
obj = pd.Series([4, 7, -5 ])
obj

0    4
1    7
2   -5
dtype: int64

Series 데이터는 파이썬 리스트와는 달리 인덱스값을 사용자가 설정할 수 있습니다. 

아래 예처럼 인덱스 인자에 값을 넘겨주면 해당 값으로 설정됩니다.

In [3]:
stock0 = pd.Series([10, 20, 30], index=['A', 'B', 'C'])
stock1 = pd.Series([30, 20, 10], index=['C', 'A', 'B'])
merge = stock0 + stock1
merge

A    30
B    30
C    60
dtype: int64

Series의 덧셈은 인덱스가 같은 성분끼리 덧셈을 수행합니다.

### 2.DataFrame

In [4]:
df1 = pd.DataFrame()

In [5]:
set1 = set(range(1,7))
set2 = set(range(3,9))
print(set1.symmetric_difference(set2))

{1, 2, 7, 8}

### 3.pivot_table

In [6]:
df = pd.read_excel("../data/02. sales_funnel.xlsx")
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [7]:
pd.pivot_table(df,index=["Name"])

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000  1.000000
Fritsch, Russel and Anderson   737550   35000  1.000000
Herman LLC                     141962   65000  2.000000
Jerde-Hilpert                  412290    5000  2.000000
Kassulke, Ondricka and Metz    307599    7000  3.000000
Keeling LLC                    688981  100000  5.000000
Kiehn-Spinka                   146832   65000  2.000000
Koepp Ltd                      729833   35000  2.000000
Kulas Inc                      218895   25000  1.500000
Purdy-Kunde                    163416   30000  1.000000
Stokes LLC                     239344    7500  1.000000
Trantow-Barrows                714466   15000  1.333333

In [8]:
pd.pivot_table(df,index=["Name","Rep","Manager"])

,,,Account,Price,Quantity
Name,Rep,Manager,,,
Barton LLC,John Smith,Debra Henley,740150,35000,1.000000
"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,737550,35000,1.000000
Herman LLC,Cedric Moss,Fred Anderson,141962,65000,2.000000
Jerde-Hilpert,John Smith,Debra Henley,412290,5000,2.000000
"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,307599,7000,3.000000
Keeling LLC,Wendy Yule,Fred Anderson,688981,100000,5.000000
Kiehn-Spinka,Daniel Hilton,Debra Henley,146832,65000,2.000000
Koepp Ltd,Wendy Yule,Fred Anderson,729833,35000,2.000000
Kulas Inc,Daniel Hilton,Debra Henley,218895,25000,1.500000
Purdy-Kunde,Cedric Moss,Fred Anderson,163416,30000,1.000000
Stokes LLC,Cedric Moss,Fred Anderson,239344,7500,1.000000
Trantow-Barrows,Craig Booker,Debra Henley,714466,15000,1.333333

In [9]:
pd.pivot_table(df,index=["Manager","Rep"])

                              Account         Price  Quantity
Manager       Rep
Debra Henley  Craig Booker   720237.0  20000.000000  1.250000
              Daniel Hilton  194874.0  38333.333333  1.666667
              John Smith     576220.0  20000.000000  1.500000
Fred Anderson Cedric Moss    196016.5  27500.000000  1.250000
              Wendy Yule     614061.5  44250.000000  3.000000

In [10]:
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"])
# 기본적으로 평균값으로 계산

                                    Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000
              Daniel Hilton  38333.333333
              John Smith     20000.000000
Fred Anderson Cedric Moss    27500.000000
              Wendy Yule     44250.000000

In [11]:
# 합계를 사용하려면,
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"], aggfunc=np.sum)

                              Price
Manager       Rep
Debra Henley  Craig Booker    80000
              Daniel Hilton  115000
              John Smith      40000
Fred Anderson Cedric Moss    110000
              Wendy Yule     177000

In [12]:
# 두가지를 구하고 싶다면,
pd.pivot_table(df,index=["Manager","Rep"],values=["Price"],aggfunc=[np.mean,len])

                                     mean   len
                                    Price Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000     4
              Daniel Hilton  38333.333333     3
              John Smith     20000.000000     2
Fred Anderson Cedric Moss    27500.000000     4
              Wendy Yule     44250.000000     4

In [13]:
# NaN이 존재하는 데이터에서는 fill_value를 활용가능
pd.pivot_table(df, index=["Manager", "Rep"], values=["Price"], columns=["Product"],aggfunc=[np.sum], fill_value=0)

                                sum
                              Price
Product                         CPU Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker    65000        5000       0    10000
              Daniel Hilton  105000           0       0    10000
              John Smith      35000        5000       0        0
Fred Anderson Cedric Moss     95000        5000       0    10000
              Wendy Yule     165000        7000    5000        0

In [14]:
# margin을 통해 전체에 대한 값을 계산 가능
pd.pivot_table(df,index=["Manager","Rep","Product"], values=["Price","Quantity"], aggfunc=[np.sum,np.mean],fill_value=0,margins=True)

                                            sum                   mean  \
                                          Price Quantity         Price
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000        2  32500.000000
                            Maintenance    5000        2   5000.000000
                            Software      10000        1  10000.000000
              Daniel Hilton CPU          105000        4  52500.000000
                            Software      10000        1  10000.000000
              John Smith    CPU           35000        1  35000.000000
                            Maintenance    5000        2   5000.000000
Fred Anderson Cedric Moss   CPU           95000        3  47500.000000
                            Maintenance    5000        1   5000.000000
                            Software      10000        1  10000.000000
              Wendy Yule    CPU          165000        7  82500.000000
                            Maintenance    7000        3   7000.000000
                            Monitor        5000        2   5000.000000
All                                      522000       30  30705.882353


                                         Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU          1.000000
                            Maintenance  2.000000
                            Software     1.000000
              Daniel Hilton CPU          2.000000
                            Software     1.000000
              John Smith    CPU          1.000000
                            Maintenance  2.000000
Fred Anderson Cedric Moss   CPU          1.500000
                            Maintenance  1.000000
                            Software     1.000000
              Wendy Yule    CPU          3.500000
                            Maintenance  3.000000
                            Monitor      2.000000
All                                      1.764706